/**
 * //TODO add comments.
 * @since 0.2
 */
package ru.nivanov;

/*
1. Реализовать модуль сборка анализа данных с sql.ru.
2. система должна использовать Jsoup для скачивания страницы.
3. Система должна запускаться раз в день. предусмотреть изменения часты запуска.
4. Система должна собирать данные только про вакансии java. учесть что JavaScript не подходит. как и Java Script.
5. Данные должны храниться в базе данных.
6. Учесть дубликаты.
7. Учитывать время последнего запуска. если это первый запуск. то нужно собрать все объявления с начало года.
8. в системе не должно быть вывод либо ввода информации. все настройки должны быть в файле.
9. для вывода нужной информации использовать логгер log4j.
 */